load-tests/basic.yml
config:
  target: http://127.0.0.1:4000
  phases:
    - duration: 1
      arrivalRate: 1
      rampTo: 5
      name: Warm up phase
    - duration: 1
      arrivalRate: 5
      rampTo: 1
      name: Ramp up load
    - duration: 3
      arrivalRate: 1
      rampTo: 3
      name: Spike phase

  plugins:
    ensure: {}
    apdex: {}
    metrics-by-endpoint: {}
  apdex:
    threshold: 100
  engines:
    playwright: {}
  processor: '../e2e/normalPersonShopper.cjs'

scenarios:

  - engine: playwright
    testFunction: 'helloFlow'